{"record_id": "cn_001", "category": "Sleep Environment", "text_content_for_rag": "Optimal bedroom temperature for sleep is generally between 60-67 degrees Fahrenheit (15-19 Celsius). A room that is too hot or too cold can disrupt sleep."}
{"record_id": "cn_002", "category": "Diet and Sleep", "text_content_for_rag": "Avoid large meals, caffeine, and alcohol close to bedtime. Heavy meals can cause discomfort, while caffeine and alcohol can interfere with sleep architecture."}
{"record_id": "cn_003", "category": "Pre-Sleep Routine", "text_content_for_rag": "Establishing a relaxing pre-sleep routine, such as reading a book, taking a warm bath, or practicing meditation, can signal to your body that it's time to wind down."}
{"record_id": "cn_004", "category": "Light Exposure", "text_content_for_rag": "Exposure to bright light in the evening, especially blue light from electronic devices, can suppress the production of melatonin, a key sleep hormone."}
{"record_id": "cn_005", "category": "Exercise and Sleep", "text_content_for_rag": "Regular physical activity can improve sleep quality, but try to avoid intense workouts within an hour or two of bedtime as it may be overly stimulating for some."}
{"record_id": "cn_006", "category": "Napping", "text_content_for_rag": "Short naps (20-30 minutes) can be refreshing, but long or late-afternoon naps can make it harder to fall asleep at night."}
{"record_id": "cn_007", "category": "Sleep Diary Entry", "user_id": "user_alpha", "date": "2025-05-21", "text_content_for_rag": "Sleep Diary (user_alpha, 2025-05-21): Went to bed at 11:30 PM, took about 45 minutes to fall asleep. Woke up twice. Felt tired in the morning. Drank coffee at 5 PM yesterday."}
{"record_id": "cn_008", "category": "Sleep Diary Entry", "user_id": "user_beta", "date": "2025-05-21", "text_content_for_rag": "Sleep Diary (user_beta, 2025-05-21): Bedtime 10:30 PM, asleep quickly. Slept through the night. Woke up feeling refreshed. Did yoga in the evening."}
{"record_id": "cn_009", "category": "Sleep Cycles", "text_content_for_rag": "A typical sleep cycle lasts about 90 minutes and includes stages of light sleep, deep sleep, and REM sleep. We go through multiple cycles per night."}
{"record_id": "cn_010", "category": "Stress Management", "text_content_for_rag": "High stress levels can significantly impact sleep. Techniques like journaling, mindfulness, or progressive muscle relaxation before bed can help manage stress and improve sleep onset."}