{"record_id": "up_001", "user_id": "user_alpha", "text_content_for_rag": "Devam (age 32). Primary sleep goal: Reduce nighttime awakenings. Preferred pre-sleep activities: reading, meditation. Reported stress level: moderate. Uses a smartwatch for sleep tracking. Works a standard 9-5 office job."}
{"record_id": "up_002", "user_id": "user_beta", "text_content_for_rag": "Monika (age 45). Sleep goal: Increase overall sleep duration and feel more rested. Enjoys listening to podcasts and light stretching before bed. Reported stress level: low. Tracks sleep with a fitness band. Works flexible hours from home."}
{"record_id": "up_003", "user_id": "user_gamma", "text_content_for_rag": "Niketu (age 28). Goal: Establish a more consistent sleep schedule. Often uses phone before bed. Stress level: varies, often high due to shift work. Does not currently use a sleep tracker."}
{"record_id": "up_004", "user_id": "user_mu", "text_content_for_rag": "Maulin (age 52). Goal: Improve deep sleep percentage. Prefers quiet evenings, sometimes watches TV. Stress: low to moderate. Uses a dedicated sleep ring. Retired."}
{"record_id": "up_005", "user_id": "user_epsilon", "text_content_for_rag": "Siddh (age 22). Goal: Fall asleep faster. Enjoys gaming late. Stress: moderate due to studies. No sleep tracker. Student."}
{"record_id": "up_006", "user_id": "user_zeta", "text_content_for_rag": "Adit (age 38). Goal: Reduce feeling groggy in the morning. Prefers a very dark room. Stress: typically low. Uses a WHOOP strap. Freelancer."}
{"record_id": "up_007", "user_id": "user_eta", "text_content_for_rag": "Kunj (age 41). Goal: Manage sleep with a newborn. Sleep is currently fragmented. Stress: high. Not actively tracking detailed metrics."}
{"record_id": "up_008", "user_id": "user_theta", "text_content_for_rag": "Swarit (age 29). Goal: Understand impact of exercise on sleep. Very active. Stress: low. Uses Garmin watch. Athlete."}
{"record_id": "up_009", "user_id": "user_iota", "text_content_for_rag": "Devansh (age 60). Goal: Address frequent waking due to noise. Light sleeper. Stress: low. No tracker. Lives in a city apartment."}
{"record_id": "up_010", "user_id": "user_kappa", "text_content_for_rag": "Arham (age 35). Goal: Improve overall sleep quality for better daytime energy. Tries to maintain a healthy lifestyle. Stress: moderate. Uses Oura ring. Entrepreneur."}